In [69]:
# Importing pandas
import pandas as pd

In [70]:
print(pd)

<module 'pandas' from 'c:\\Users\\NDUKWE\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\pandas\\__init__.py'>

Series -> One dimensional arrays that can store various data types.

In [71]:
# converting tuple to series
h = ('AA', '2012-02-01', 100, 10.2)
s = pd.Series(h)

type(s)

pandas.core.series.Series

In [72]:
print(s)

0            AA
1    2012-02-01
2           100
3          10.2
dtype: object

In [73]:
# converting dict to Series
d = {'name': 'IBM', 'date':'2010-09-08','shares':100, 'price':10.2}
ds = pd.Series(d)
print(d)
print(ds)

{'name': 'IBM', 'date': '2010-09-08', 'shares': 100, 'price': 10.2}
name             IBM
date      2010-09-08
shares           100
price           10.2
dtype: object

In [74]:
type(ds)

pandas.core.series.Series

In [75]:
m =  ['Jim', '2001-08-02', 90, 3.2]
m = pd.Series(m, index=['name', 'date', 'amount', 'percentage'])
print(m)

name                 Jim
date          2001-08-02
amount                90
percentage           3.2
dtype: object

In [76]:
m['percentage']

3.2

In [77]:
m[['name', 'percentage']]

name          Jim
percentage    3.2
dtype: object

DataFrame -> Two Dimensional arrays (row and colum index)

In [78]:
data = {
    'name': [ 'Jim', 'Ray', 'Paul'  ],
    'shares': [ '10', '13', '12'],
    'price': [ '200', '131', '144'],
    'color':  [ 'blue', 'red', 'pink'],
}

In [79]:
print(data)

{'name': ['Jim', 'Ray', 'Paul'], 'shares': ['10', '13', '12'], 'price': ['200', '131', '144'], 'color': ['blue', 'red', 'pink']}

In [80]:
df = pd.DataFrame(data=data)
type(df)

pandas.core.frame.DataFrame

In [81]:
print(df)

   name shares price color
0   Jim     10   200  blue
1   Ray     13   131   red
2  Paul     12   144  pink

In [82]:
df['size'] = ['big', 'small', 'large']
df

   name shares price color   size
0   Jim     10   200  blue    big
1   Ray     13   131   red  small
2  Paul     12   144  pink  large

In [83]:
df['age'] = 'null'
df

   name shares price color   size   age
0   Jim     10   200  blue    big  null
1   Ray     13   131   red  small  null
2  Paul     12   144  pink  large  null

In [84]:
df.index = ['one','two', 'three']
df

       name shares price color   size   age
one     Jim     10   200  blue    big  null
two     Ray     13   131   red  small  null
three  Paul     12   144  pink  large  null

In [85]:
df.set_index(['name']) #inplace = True -> makes it permanent
df

       name shares price color   size   age
one     Jim     10   200  blue    big  null
two     Ray     13   131   red  small  null
three  Paul     12   144  pink  large  null

In [86]:
df['shares']

one      10
two      13
three    12
Name: shares, dtype: object

In [92]:
df.loc['one'] # select a single row

name       Jim
shares      10
price      200
color     blue
size       big
age       null
Name: one, dtype: object

In [93]:
df.loc[:, 'shares']

one      10
two      13
three    12
Name: shares, dtype: object

In [94]:
df.loc['one',:]

name       Jim
shares      10
price      200
color     blue
size       big
age       null
Name: one, dtype: object

In [95]:
del df['age']

In [96]:
df

       name shares price color   size
one     Jim     10   200  blue    big
two     Ray     13   131   red  small
three  Paul     12   144  pink  large

In [97]:
df.drop('shares', axis = 1)

       name price color   size
one     Jim   200  blue    big
two     Ray   131   red  small
three  Paul   144  pink  large

In [98]:
df.drop('two', axis=0)

       name shares price color   size
one     Jim     10   200  blue    big
three  Paul     12   144  pink  large